## Part 1

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('demo_data.sqlite3')
curs = conn.cursor()

In [19]:
query = 'CREATE TABLE demo (s varchar(1), x int, y int);'
curs.execute(query)

OperationalError: table demo already exists

In [4]:
insert_query = "INSERT INTO demo VALUES ('g',3,9)"
curs.execute(insert_query)
insert_query = "INSERT INTO demo VALUES ('v',5,7)"
curs.execute(insert_query)
insert_query = "INSERT INTO demo VALUES ('f',8,7)"
curs.execute(insert_query)

In [6]:
conn.commit()

In [8]:
query = 'SELECT COUNT(*) FROM demo'
curs.execute(query)
curs.fetchall()

[(3,)]

In [15]:
query = '''SELECT COUNT(*) FROM demo
           WHERE x>= 5 AND y>=5'''
curs.execute(query).fetchall()

[(2,)]

In [18]:
query = '''SELECT COUNT(distinct y) FROM demo'''
curs.execute(query).fetchall()

[(2,)]

## Part 2

In [20]:
conn = sqlite3.connect('northwind_small.sqlite3')
curs = conn.cursor()

In [27]:
query = ''' SELECT ProductName, UnitPrice FROM Product
            Order by UnitPrice DESC
            Limit 10
        '''
curs.execute(query).fetchall()

[('Côte de Blaye', 263.5),
 ('Thüringer Rostbratwurst', 123.79),
 ('Mishi Kobe Niku', 97),
 ("Sir Rodney's Marmalade", 81),
 ('Carnarvon Tigers', 62.5),
 ('Raclette Courdavault', 55),
 ('Manjimup Dried Apples', 53),
 ('Tarte au sucre', 49.3),
 ('Ipoh Coffee', 46),
 ('Rössle Sauerkraut', 45.6)]

In [97]:
query = ''' SELECT AVG(HireDate-BirthDate) FROM Employee
        '''
curs.execute(query).fetchall()

[(37.22222222222222,)]

In [98]:
query = ''' SELECT CITY, AVG(HireDate-BirthDate) FROM Employee
            GROUP BY CITY
        '''
curs.execute(query).fetchall()

[('Kirkland', 29.0),
 ('London', 32.5),
 ('Redmond', 56.0),
 ('Seattle', 40.0),
 ('Tacoma', 40.0)]

## Part 3

In [54]:
query = ''' SELECT UnitPrice,CompanyName 
            FROM Product as P
            LEFT JOIN Supplier as S
            ON P.ID = S.ID 
            ORDER BY UnitPrice DESC
            LIMIT 10            
        '''
curs.execute(query).fetchall()

[(263.5, None),
 (123.79, "Forêts d'érables"),
 (97, 'PB Knäckebröd AB'),
 (81, 'Leka Trading'),
 (62.5, 'Aux joyeux ecclésiastiques'),
 (55, None),
 (53, None),
 (49.3, None),
 (46, None),
 (45.6, 'Gai pâturage')]

In [96]:
query = ''' SELECT P.CategoryID, COUNT(distinct O.ProductID)
            FROM OrderDetail as O
            JOIN Product as P
            ON P.ID = O.ProductID
            GROUP BY P.CategoryID
            ORDER BY COUNT(distinct O.ProductID) DESC
        '''
curs.execute(query).fetchall()

[(3, 13), (1, 12), (2, 12), (8, 12), (4, 10), (5, 7), (6, 6), (7, 5)]

In [99]:
query = ''' SELECT E.ID, E.FirstName, E.LastName, COUNT(ET.TerritoryID) 
            FROM Employee as E
            JOIN EmployeeTerritory as ET
            ON E.ID = ET.EmployeeID
            GROUP BY E.ID
            ORDER BY COUNT(ET.TerritoryID) DESC
        '''
curs.execute(query).fetchall()

[(7, 'Robert', 'King', 10),
 (2, 'Andrew', 'Fuller', 7),
 (5, 'Steven', 'Buchanan', 7),
 (9, 'Anne', 'Dodsworth', 7),
 (6, 'Michael', 'Suyama', 5),
 (3, 'Janet', 'Leverling', 4),
 (8, 'Laura', 'Callahan', 4),
 (4, 'Margaret', 'Peacock', 3),
 (1, 'Nancy', 'Davolio', 2)]